<h1><center>Hospital Database</center></h1>

In [1]:
import pandas as pd
from sqlalchemy import create_engine
import psycopg2
engine = create_engine("postgresql+psycopg2://postgres:Hero33!!@localhost/Hospital")
%load_ext sql
%sql postgresql://postgres:Hero33!!@localhost/Hospital

'Connected: postgres@Hospital'

#### 1. Write a query in SQL to find the information of the nurses who are yet to be registered.

In [2]:
%%sql
SELECT *
FROM nurse
WHERE registered = False;

 * postgresql://postgres:***@localhost/Hospital
1 rows affected.

[(103, 'Paul Flowers', 'Nurse', False, 333333330)]

In [3]:
nurse = pd.read_sql('SELECT * FROM nurse;', engine)
nurse[nurse['registered'] == False]

   employeeid          name position  registered        ssn
2         103  Paul Flowers    Nurse       False  333333330

#### 2. Write a query in SQL to find the name of the nurses who are the head of their department.

In [4]:
%%sql
SELECT name AS nurse
FROM nurse
WHERE position LIKE '%Head%';

 * postgresql://postgres:***@localhost/Hospital
1 rows affected.

[('Carla Espinosa',)]

In [5]:
nurse[nurse['position'].str.contains('Head')]['name']

0    Carla Espinosa
Name: name, dtype: object

#### 3. Write a query in SQL to find the name of the physicians who are the head of each department.

In [6]:
%%sql
SELECT  p.name AS physician,
        d.name AS department
FROM department d
INNER JOIN physician p
    ON d.head = p.employeeid;

 * postgresql://postgres:***@localhost/Hospital
3 rows affected.

[('Percival Cox', 'General Medicine'),
 ('John Wen', 'Surgery'),
 ('Molly Clock', 'Psychiatry')]

In [7]:
department = pd.read_sql('SELECT * FROM department;', engine)
physician = pd.read_sql('SELECT * FROM physician;', engine)
pd.merge(department, physician, left_on='head', right_on='employeeid', suffixes=('_department', '_physician'))[['name_physician', 'name_department']]

  name_physician   name_department
0   Percival Cox  General Medicine
1       John Wen           Surgery
2    Molly Clock        Psychiatry

#### 4. Write a query in SQL to count the number of patients who took an appointment with at least one physician.

In [8]:
%%sql
SELECT COUNT(DISTINCT patient) AS number_of_patients
FROM appointment;

 * postgresql://postgres:***@localhost/Hospital
1 rows affected.

[(4,)]

In [9]:
appointment = pd.read_sql('SELECT * FROM appointment;', engine)
appointment['patient'].nunique()

4

#### 5. Write a query in SQL to find the floor and the block of the room 212.

In [10]:
%%sql
SELECT  blockfloor AS floor,
        blockcode AS block
FROM room
WHERE roomnumber = 212;

 * postgresql://postgres:***@localhost/Hospital
1 rows affected.

[(2, 2)]

In [11]:
room = pd.read_sql('SELECT * FROM room;', engine)
room[room['roomnumber'] == 212][['blockfloor', 'blockcode']]

    blockfloor  blockcode
13           2          2

#### 6. Write a query in SQL to count the number of available rooms.

In [12]:
%%sql
SELECT COUNT(*) AS available_rooms
FROM room
WHERE unavailable = False;

 * postgresql://postgres:***@localhost/Hospital
1 rows affected.

[(29,)]

In [13]:
len(room[room['unavailable'] == False])

29

#### 7. Write a query in SQL to count the number of unavailable rooms.

In [14]:
%%sql
SELECT COUNT(*) AS unavailable_rooms
FROM room
WHERE unavailable = True;

 * postgresql://postgres:***@localhost/Hospital
1 rows affected.

[(7,)]

In [15]:
len(room[room['unavailable'] == True])

7

#### 8. Write a query in SQL to find the name of the physicians and the departments they are affiliated with.

In [16]:
%%sql
SELECT  p.name AS physician,
        d.name AS department
FROM affiliated_with a
INNER JOIN physician p
    ON a.physician = p.employeeid
INNER JOIN department d
    ON a.department = d.departmentid;

 * postgresql://postgres:***@localhost/Hospital
11 rows affected.

[('John Dorian', 'General Medicine'),
 ('Elliot Reid', 'General Medicine'),
 ('Christopher Turk', 'General Medicine'),
 ('Christopher Turk', 'Surgery'),
 ('Percival Cox', 'General Medicine'),
 ('Bob Kelso', 'General Medicine'),
 ('Todd Quinlan', 'Surgery'),
 ('John Wen', 'General Medicine'),
 ('John Wen', 'Surgery'),
 ('Keith Dudemeister', 'General Medicine'),
 ('Molly Clock', 'Psychiatry')]

In [17]:
affiliated_with = pd.read_sql('SELECT * FROM affiliated_with;', engine)
df_merged = pd.merge(physician, affiliated_with, left_on='employeeid', right_on='physician')
pd.merge(df_merged, department, left_on='department', right_on='departmentid', suffixes=('_physician', '_department'))[['name_physician', 'name_department']]

       name_physician   name_department
0         John Dorian  General Medicine
1         Elliot Reid  General Medicine
2    Christopher Turk  General Medicine
3        Percival Cox  General Medicine
4           Bob Kelso  General Medicine
5            John Wen  General Medicine
6   Keith Dudemeister  General Medicine
7    Christopher Turk           Surgery
8        Todd Quinlan           Surgery
9            John Wen           Surgery
10        Molly Clock        Psychiatry

#### 9. Write a query in SQL to find the name of the physicians who are trained for a special treatement.

In [18]:
%%sql
SELECT  p.name AS physician,
        pr.name AS treatment
FROM trained_in t
INNER JOIN physician p
    ON t.physician = p.employeeid
INNER JOIN procedure pr
    ON pr.code = t.treatment;

 * postgresql://postgres:***@localhost/Hospital
15 rows affected.

[('Christopher Turk', 'Reverse Rhinopodoplasty'),
 ('Christopher Turk', 'Obtuse Pyloric Recombobulation'),
 ('Christopher Turk', 'Obfuscated Dermogastrotomy'),
 ('Christopher Turk', 'Reversible Pancreomyoplasty'),
 ('Christopher Turk', 'Follicular Demiectomy'),
 ('Todd Quinlan', 'Obtuse Pyloric Recombobulation'),
 ('Todd Quinlan', 'Obfuscated Dermogastrotomy'),
 ('Todd Quinlan', 'Reversible Pancreomyoplasty'),
 ('John Wen', 'Reverse Rhinopodoplasty'),
 ('John Wen', 'Obtuse Pyloric Recombobulation'),
 ('John Wen', 'Folded Demiophtalmectomy'),
 ('John Wen', 'Complete Walletectomy'),
 ('John Wen', 'Obfuscated Dermogastrotomy'),
 ('John Wen', 'Reversible Pancreomyoplasty'),
 ('John Wen', 'Follicular Demiectomy')]

In [19]:
trained_in = pd.read_sql('SELECT * FROM trained_in;', engine)
procedure = pd.read_sql('SELECT * FROM procedure;', engine)
df_merged = pd.merge(trained_in, physician, left_on='physician', right_on='employeeid')
pd.merge(df_merged, procedure, left_on='treatment', right_on='code', suffixes=('_physician', '_treatment'))[['name_physician', 'name_treatment']]

      name_physician                  name_treatment
0   Christopher Turk         Reverse Rhinopodoplasty
1           John Wen         Reverse Rhinopodoplasty
2   Christopher Turk  Obtuse Pyloric Recombobulation
3       Todd Quinlan  Obtuse Pyloric Recombobulation
4           John Wen  Obtuse Pyloric Recombobulation
5   Christopher Turk      Obfuscated Dermogastrotomy
6       Todd Quinlan      Obfuscated Dermogastrotomy
7           John Wen      Obfuscated Dermogastrotomy
8   Christopher Turk     Reversible Pancreomyoplasty
9       Todd Quinlan     Reversible Pancreomyoplasty
10          John Wen     Reversible Pancreomyoplasty
11  Christopher Turk           Follicular Demiectomy
12          John Wen           Follicular Demiectomy
13          John Wen        Folded Demiophtalmectomy
14          John Wen           Complete Walletectomy

#### 10. Write a query in SQL to find the name of the physicians with department thatare yet to be affiliated.

In [20]:
%%sql
SELECT  p.name AS physician,
        d.name AS department
FROM physician p
INNER JOIN affiliated_with a
    ON p.employeeid = a.physician
INNER JOIN department d
    On d.departmentid = a.department
WHERE a.primaryaffiliation = False;

 * postgresql://postgres:***@localhost/Hospital
2 rows affected.

[('Christopher Turk', 'General Medicine'), ('John Wen', 'General Medicine')]

In [21]:
df_merged = pd.merge(physician, affiliated_with, left_on='employeeid', right_on='physician')
df_merged_2 = pd.merge(df_merged, department, left_on='department', right_on='departmentid', suffixes=('_physician', '_department'))
df_merged_2[df_merged_2['primaryaffiliation'] == False][['name_physician', 'name_department']]

     name_physician   name_department
2  Christopher Turk  General Medicine
5          John Wen  General Medicine

#### 11. Write a query in SQL to find the name of the patients with their physicians by whom they got their preliminary treatement.

In [22]:
%%sql
SELECT  pa.name AS patient,
        ph.name AS physician
FROM patient pa
INNER JOIN physician ph
    ON pa.pcp = ph.employeeid;

 * postgresql://postgres:***@localhost/Hospital
4 rows affected.

[('John Smith', 'John Dorian'),
 ('Random J. Patient', 'Elliot Reid'),
 ('Grace Ritchie', 'Elliot Reid'),
 ('Dennis Doe', 'Christopher Turk')]

In [23]:
patient = pd.read_sql('SELECT * FROM patient;', engine)
pd.merge(patient, physician, left_on='pcp', right_on='employeeid', suffixes=('_patient', '_physician'))[['name_patient', 'name_physician']]

        name_patient    name_physician
0         John Smith       John Dorian
1      Grace Ritchie       Elliot Reid
2  Random J. Patient       Elliot Reid
3         Dennis Doe  Christopher Turk

#### 12. Write a query in SQL to find the name of the patients and the number of physicians they have taken appointment.

In [24]:
%%sql
SELECT  p.name AS patient,
        COUNT(*) AS number_of_physicians
FROM appointment a
INNER JOIN patient p
    ON a.patient = p.ssn
GROUP BY p.name;

 * postgresql://postgres:***@localhost/Hospital
4 rows affected.

[('John Smith', 3),
 ('Dennis Doe', 3),
 ('Random J. Patient', 1),
 ('Grace Ritchie', 2)]

In [25]:
pd.merge(appointment, patient, left_on='patient', right_on='ssn').groupby(by='name').size()

name
Dennis Doe           3
Grace Ritchie        2
John Smith           3
Random J. Patient    1
dtype: int64

#### 13. Write a query in SQL to count number of unique patients who got an appointment for examination room C.

In [26]:
%%sql
SELECT COUNT(DISTINCT patient) AS unique_patients
FROM appointment
WHERE examinationroom = 'C';

 * postgresql://postgres:***@localhost/Hospital
1 rows affected.

[(3,)]

In [27]:
appointment[appointment['examinationroom'] == 'C']['patient'].nunique()

3

#### 14. Write a query in SQL to find the name of the patients and the examination room where they have to go for their treatment.

In [28]:
%%sql
SELECT  p.name AS patient,
        a.examinationroom
FROM appointment a
INNER JOIN patient p
    ON a.patient = p.ssn;

 * postgresql://postgres:***@localhost/Hospital
9 rows affected.

[('John Smith', 'A'),
 ('Grace Ritchie', 'B'),
 ('John Smith', 'A'),
 ('Dennis Doe', 'B'),
 ('Dennis Doe', 'C'),
 ('Random J. Patient', 'C'),
 ('John Smith', 'C'),
 ('Dennis Doe', 'A'),
 ('Grace Ritchie', 'B')]

In [29]:
pd.merge(appointment, patient, left_on='patient', right_on='ssn')[['name', 'examinationroom']]

                name examinationroom
0         John Smith               A
1         John Smith               A
2         John Smith               C
3      Grace Ritchie               B
4      Grace Ritchie               B
5         Dennis Doe               B
6         Dennis Doe               C
7         Dennis Doe               A
8  Random J. Patient               C

#### 15. Write a query in SQL to find the name of the nurses and the rooms scheduled where they will assist the physicians.

In [30]:
%%sql
SELECT n.name AS nurse,
        a.examinationroom AS room
FROM nurse n
INNER JOIN appointment a
    ON n.employeeid = a.prepnurse;

 * postgresql://postgres:***@localhost/Hospital
7 rows affected.

[('Carla Espinosa', 'A'),
 ('Carla Espinosa', 'B'),
 ('Laverne Roberts', 'A'),
 ('Paul Flowers', 'B'),
 ('Paul Flowers', 'C'),
 ('Laverne Roberts', 'A'),
 ('Carla Espinosa', 'B')]

In [31]:
nurse = pd.read_sql('SELECT * FROM nurse;', engine)
pd.merge(nurse, appointment, left_on='employeeid', right_on='prepnurse')[['name', 'examinationroom']]

              name examinationroom
0   Carla Espinosa               A
1   Carla Espinosa               B
2   Carla Espinosa               B
3  Laverne Roberts               A
4  Laverne Roberts               A
5     Paul Flowers               B
6     Paul Flowers               C

#### 16. Write a query in SQL to find the name of the patients who took an appointment on the 25th of April at 10 am and also display their physician, assisting nurses and room no.

In [32]:
%%sql
SELECT  p.name AS patient,
        ph.name AS physician,        
        n.name AS nurse,
        a.examinationroom AS room
FROM patient p
INNER JOIN physician ph
    ON p.pcp = ph.employeeid
INNER JOIN appointment a
    ON p.ssn = a.patient
INNER JOIN nurse n
    ON n.employeeid = a.prepnurse
WHERE a.start_dt_time = '2008-04-25 10:00:00';

 * postgresql://postgres:***@localhost/Hospital
2 rows affected.

[('John Smith', 'John Dorian', 'Laverne Roberts', 'A'),
 ('Dennis Doe', 'Christopher Turk', 'Paul Flowers', 'B')]

In [33]:
df_merged = pd.merge(physician, patient, left_on='employeeid', right_on='pcp', suffixes=('_physician', '_patient'))
df_merged_2 = pd.merge(df_merged, appointment, left_on='ssn_patient', right_on='patient')
df_merged_3 = pd.merge(df_merged_2, nurse, left_on='prepnurse', right_on='employeeid', suffixes=('', '_nurse'))
df_merged_3[df_merged_3['start_dt_time'] == '2008-04-25 10:00:00'][['name_patient', 'name_physician', 'name', 'examinationroom']]

  name_patient    name_physician             name examinationroom
3   John Smith       John Dorian  Laverne Roberts               A
6   Dennis Doe  Christopher Turk     Paul Flowers               B

#### 17. Write a query in SQL to find the name of patients and their physicians who do not require any assistance from a nurse.

In [34]:
%%sql
SELECT p.name AS patient,
       ph.name AS physician
FROM patient p
INNER JOIN physician ph
    ON p.pcp = ph.employeeid
INNER JOIN appointment a
    ON a.patient = p.ssn
WHERE A.prepnurse IS NULL;

 * postgresql://postgres:***@localhost/Hospital
2 rows affected.

[('John Smith', 'John Dorian'), ('Dennis Doe', 'Christopher Turk')]

In [35]:
df_merged = pd.merge(patient, physician, left_on='pcp', right_on='employeeid', suffixes=('_patient', '_physician'))
df_merged_2 = pd.merge(df_merged, appointment, left_on='ssn_patient', right_on='patient')
df_merged_2[df_merged_2['prepnurse'].isnull()][['name_patient', 'name_physician']]

  name_patient    name_physician
2   John Smith       John Dorian
7   Dennis Doe  Christopher Turk

#### 18. Write a query in SQL to find the name of the patients, their treating physicians and medications.

In [36]:
%%sql
SELECT  p.name AS patient,
        ph.name AS physician,
        m.name AS medication
FROM patient p
INNER JOIN physician ph
    ON p.pcp = ph.employeeid
INNER JOIN prescribes pr
    ON p.ssn = pr.patient
INNER JOIN medication m
    ON pr.medication = m.code;

 * postgresql://postgres:***@localhost/Hospital
3 rows affected.

[('John Smith', 'John Dorian', 'Procrastin-X'),
 ('Dennis Doe', 'Christopher Turk', 'Thesisin'),
 ('Dennis Doe', 'Christopher Turk', 'Thesisin')]

In [37]:
prescribes = pd.read_sql('SELECT * FROM prescribes;', engine)
medication = pd.read_sql('SELECT * FROM medication;', engine)
df_merged = pd.merge(patient, physician, left_on='pcp', right_on='employeeid', suffixes=('_patient', '_physician'))
df_merged_2 = pd.merge(df_merged, prescribes, left_on='ssn_patient', right_on='patient')
df_merged_3 = pd.merge(df_merged_2, medication, left_on='medication', right_on='code', suffixes=('', '_medication'))[['name_patient', 'name_physician', 'name']]
df_merged_3

  name_patient    name_physician          name
0   John Smith       John Dorian  Procrastin-X
1   Dennis Doe  Christopher Turk      Thesisin
2   Dennis Doe  Christopher Turk      Thesisin

#### 19. Write a query in SQL to count the number of available rooms in each block.

In [38]:
%%sql
SELECT  blockcode AS block,
        COUNT(*) AS available_rooms
FROM room
WHERE unavailable = False
GROUP BY blockcode
ORDER BY blockcode;

 * postgresql://postgres:***@localhost/Hospital
3 rows affected.

[(1, 9), (2, 10), (3, 10)]

In [39]:
room[room['unavailable'] == False].groupby(by='blockcode').size()

blockcode
1     9
2    10
3    10
dtype: int64

#### 20. Write a query in SQL to count the number of available rooms in each floor.

In [40]:
%%sql
SELECT  blockfloor AS floor,
        COUNT(*) AS available_rooms
FROM room
WHERE unavailable = False
GROUP BY blockfloor
ORDER BY blockfloor;

 * postgresql://postgres:***@localhost/Hospital
4 rows affected.

[(1, 8), (2, 7), (3, 7), (4, 7)]

In [41]:
room[room['unavailable'] == False].groupby(by='blockfloor').size()

blockfloor
1    8
2    7
3    7
4    7
dtype: int64

#### 21. Write a query in SQL to count the number of available rooms for each block in each floor.

In [42]:
%%sql
SELECT  blockcode AS block,
        blockfloor AS floor,
        COUNT(*) AS available_rooms
FROM room
WHERE unavailable = False
GROUP BY blockcode,blockfloor
ORDER BY blockcode;

 * postgresql://postgres:***@localhost/Hospital
12 rows affected.

[(1, 1, 3),
 (1, 2, 2),
 (1, 3, 2),
 (1, 4, 2),
 (2, 1, 2),
 (2, 2, 2),
 (2, 3, 3),
 (2, 4, 3),
 (3, 1, 3),
 (3, 2, 3),
 (3, 3, 2),
 (3, 4, 2)]

In [43]:
room[room['unavailable'] == False].groupby(by=['blockcode', 'blockfloor']).size()

blockcode  blockfloor
1          1             3
           2             2
           3             2
           4             2
2          1             2
           2             2
           3             3
           4             3
3          1             3
           2             3
           3             2
           4             2
dtype: int64

#### 22. Write a query in SQL to find the floor where the maximum no of rooms are available.

In [44]:
%%sql
SELECT  blockfloor AS floor,
        COUNT(*) number_of_rooms
FROM room
WHERE unavailable = False
GROUP BY blockfloor
ORDER BY COUNT(*) DESC
LIMIT 1;

 * postgresql://postgres:***@localhost/Hospital
1 rows affected.

[(1, 8)]

In [45]:
room[room['unavailable'] == False].groupby(by='blockfloor').size().head(1)

blockfloor
1    8
dtype: int64

#### 23. Write a query in SQL to find the floor where the minimum no of rooms are available.

In [46]:
%%sql
SELECT  blockfloor AS floor,
        COUNT(*) number_of_rooms
FROM room
WHERE unavailable = False
GROUP BY blockfloor
ORDER BY COUNT(*)
LIMIT 1;

 * postgresql://postgres:***@localhost/Hospital
1 rows affected.

[(4, 7)]

#### 24. Write a query in SQL to findthe name of the patients, their block, floor, and room number where they are admitted.

In [47]:
%%sql
SELECT  p.name AS patient,
        s.room AS room,
        r.blockfloor AS floor,
        r.blockcode AS block
FROM patient p
INNER JOIN stay s
    ON p.ssn = s.patient
INNER JOIN room r
    ON r.roomnumber = s.room;

 * postgresql://postgres:***@localhost/Hospital
3 rows affected.

[('John Smith', 111, 1, 2),
 ('Dennis Doe', 112, 1, 2),
 ('Random J. Patient', 123, 1, 3)]

In [48]:
stay = pd.read_sql('SELECT * FROM stay;', engine)
df_merged = pd.merge(patient, stay, left_on='ssn', right_on='patient')
pd.merge(df_merged, room, left_on='room', right_on='roomnumber')[['name', 'room', 'blockfloor', 'blockcode']]

                name  room  blockfloor  blockcode
0         John Smith   111           1          2
1  Random J. Patient   123           1          3
2         Dennis Doe   112           1          2

#### 25. Write a query in SQL to find the nurses and the block where they are to attend to the patients on call.

In [49]:
%%sql
SELECT  n.name AS nurse,
        o.blockcode AS block
FROM on_call O
INNER JOIN nurse n
    ON n.employeeid = o.nurse;

 * postgresql://postgres:***@localhost/Hospital
6 rows affected.

[('Carla Espinosa', 1),
 ('Carla Espinosa', 2),
 ('Laverne Roberts', 3),
 ('Paul Flowers', 1),
 ('Paul Flowers', 2),
 ('Paul Flowers', 3)]

In [50]:
on_call = pd.read_sql('SELECT * FROM on_call;', engine)
pd.merge(on_call, nurse, left_on='nurse', right_on='employeeid')[['name', 'blockcode']]

              name  blockcode
0   Carla Espinosa          1
1   Carla Espinosa          2
2  Laverne Roberts          3
3     Paul Flowers          1
4     Paul Flowers          2
5     Paul Flowers          3